IOTracer_tests/ycsb_tests/ycsb_results_kernel_submit
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 24191
[OVERALL], Throughput(ops/sec), 4133.7687569757345
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 55
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22735728163366542
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 55
[TOTAL_GC_TIME_%], Time(%), 0.22735728163366542
[READ], Operations, 59841
[READ], AverageLatency(us), 220.02239267391923
[READ], MinLatency(us), 105
[READ], MaxLatency(us), 13279
[READ], 95thPercentileLatency(us), 378
[READ], 99thPercentileLatency(us), 662
[READ], Return=OK, 59841
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1300.0
[CLEANUP], MinLatency(us), 1300
[CLEANUP], MaxLatency(us), 1300
[CLEANUP], 95thPercentileLatency(us), 1300
[CLEANUP], 99thPercentileLatency(us), 1300
[UPDATE], Operations, 40159
[UPDATE], AverageLatency(us), 245.68089344854204
[UPDATE], MinLatency(us), 116
[UPDATE], MaxLatency(us), 58399
[UPDATE], 95thPercentileLatency(us), 436
[UPDATE], 99thPercentileLatency(us), 718
[UPDATE], Return=OK, 40159
\n------------------------------------------\n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 24938
[OVERALL], Throughput(ops/sec), 4009.944662763654
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 51
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.20450717780094635
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 51
[TOTAL_GC_TIME_%], Time(%), 0.20450717780094635
[READ], Operations, 60280
[READ], AverageLatency(us), 227.05051426675513
[READ], MinLatency(us), 105
[READ], MaxLatency(us), 10807
[READ], 95thPercentileLatency(us), 383
[READ], 99thPercentileLatency(us), 969
[READ], Return=OK, 60280
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1692.0
[CLEANUP], MinLatency(us), 1692
[CLEANUP], MaxLatency(us), 1692
[CLEANUP], 95thPercentileLatency(us), 1692
[CLEANUP], 99thPercentileLatency(us), 1692
[UPDATE], Operations, 39720
[UPDATE], AverageLatency(us), 255.08094159113796
[UPDATE], MinLatency(us), 119
[UPDATE], MaxLatency(us), 61471
[UPDATE], 95thPercentileLatency(us), 443
[UPDATE], 99thPercentileLatency(us), 1082
[UPDATE], Return=OK, 39720
\n------------------------------------------\n
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 26041
[OVERALL], Throughput(ops/sec), 3840.098306516647
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 58
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22272570177796552
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 58
[TOTAL_GC_TIME_%], Time(%), 0.22272570177796552
[READ], Operations, 60007
[READ], AverageLatency(us), 237.32816171446666
[READ], MinLatency(us), 105
[READ], MaxLatency(us), 71487
[READ], 95thPercentileLatency(us), 415
[READ], 99thPercentileLatency(us), 826
[READ], Return=OK, 60007
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1294.0
[CLEANUP], MinLatency(us), 1294
[CLEANUP], MaxLatency(us), 1294
[CLEANUP], 95thPercentileLatency(us), 1294
[CLEANUP], 99thPercentileLatency(us), 1294
[UPDATE], Operations, 39993
[UPDATE], AverageLatency(us), 262.33105793513863
[UPDATE], MinLatency(us), 115
[UPDATE], MaxLatency(us), 13887
[UPDATE], 95thPercentileLatency(us), 477
[UPDATE], 99thPercentileLatency(us), 857
[UPDATE], Return=OK, 39993
\n------------------------------------------\n