IOTracer_tests/ycsb_tests/ycsb_results_ringbuf_128kb
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 36766
[OVERALL], Throughput(ops/sec), 2719.90425937007
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 56
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.15231463852472393
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 56
[TOTAL_GC_TIME_%], Time(%), 0.15231463852472393
[READ], Operations, 60535
[READ], AverageLatency(us), 333.55394399933925
[READ], MinLatency(us), 126
[READ], MaxLatency(us), 40031
[READ], 95thPercentileLatency(us), 604
[READ], 99thPercentileLatency(us), 1106
[READ], Return=OK, 60535
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1708.0
[CLEANUP], MinLatency(us), 1708
[CLEANUP], MaxLatency(us), 1708
[CLEANUP], 95thPercentileLatency(us), 1708
[CLEANUP], 99thPercentileLatency(us), 1708
[UPDATE], Operations, 39465
[UPDATE], AverageLatency(us), 381.54732041049033
[UPDATE], MinLatency(us), 147
[UPDATE], MaxLatency(us), 114815
[UPDATE], 95thPercentileLatency(us), 675
[UPDATE], 99thPercentileLatency(us), 1219
[UPDATE], Return=OK, 39465

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 28556
[OVERALL], Throughput(ops/sec), 3501.8910211514217
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 79
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.27664939067096234
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 79
[TOTAL_GC_TIME_%], Time(%), 0.27664939067096234
[READ], Operations, 60372
[READ], AverageLatency(us), 261.67615782150665
[READ], MinLatency(us), 126
[READ], MaxLatency(us), 13087
[READ], 95thPercentileLatency(us), 455
[READ], 99thPercentileLatency(us), 741
[READ], Return=OK, 60372
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1790.0
[CLEANUP], MinLatency(us), 1790
[CLEANUP], MaxLatency(us), 1790
[CLEANUP], 95thPercentileLatency(us), 1790
[CLEANUP], 99thPercentileLatency(us), 1790
[UPDATE], Operations, 39628
[UPDATE], AverageLatency(us), 291.96583223983043
[UPDATE], MinLatency(us), 138
[UPDATE], MaxLatency(us), 70015
[UPDATE], 95thPercentileLatency(us), 512
[UPDATE], 99thPercentileLatency(us), 802
[UPDATE], Return=OK, 39628

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 29041
[OVERALL], Throughput(ops/sec), 3443.407596157157
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 82
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.28235942288488686
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 82
[TOTAL_GC_TIME_%], Time(%), 0.28235942288488686
[READ], Operations, 60068
[READ], AverageLatency(us), 266.72474528867286
[READ], MinLatency(us), 125
[READ], MaxLatency(us), 75583
[READ], 95thPercentileLatency(us), 441
[READ], 99thPercentileLatency(us), 690
[READ], Return=OK, 60068
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1651.0
[CLEANUP], MinLatency(us), 1651
[CLEANUP], MaxLatency(us), 1651
[CLEANUP], 95thPercentileLatency(us), 1651
[CLEANUP], 99thPercentileLatency(us), 1651
[UPDATE], Operations, 39932
[UPDATE], AverageLatency(us), 297.4649654412501
[UPDATE], MinLatency(us), 137
[UPDATE], MaxLatency(us), 9527
[UPDATE], 95thPercentileLatency(us), 496
[UPDATE], 99thPercentileLatency(us), 741
[UPDATE], Return=OK, 39932

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 36870
[OVERALL], Throughput(ops/sec), 2712.2321670735014
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 100
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.27122321670735017
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 100
[TOTAL_GC_TIME_%], Time(%), 0.27122321670735017
[READ], Operations, 60113
[READ], AverageLatency(us), 336.7697503035949
[READ], MinLatency(us), 109
[READ], MaxLatency(us), 13855
[READ], 95thPercentileLatency(us), 652
[READ], 99thPercentileLatency(us), 1412
[READ], Return=OK, 60113
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3087.0
[CLEANUP], MinLatency(us), 3086
[CLEANUP], MaxLatency(us), 3087
[CLEANUP], 95thPercentileLatency(us), 3087
[CLEANUP], 99thPercentileLatency(us), 3087
[UPDATE], Operations, 39887
[UPDATE], AverageLatency(us), 378.8306716474039
[UPDATE], MinLatency(us), 128
[UPDATE], MaxLatency(us), 86079
[UPDATE], 95thPercentileLatency(us), 740
[UPDATE], 99thPercentileLatency(us), 1506
[UPDATE], Return=OK, 39887

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 32350
[OVERALL], Throughput(ops/sec), 3091.190108191654
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 87
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2689335394126739
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 87
[TOTAL_GC_TIME_%], Time(%), 0.2689335394126739
[READ], Operations, 60004
[READ], AverageLatency(us), 296.79936337577493
[READ], MinLatency(us), 127
[READ], MaxLatency(us), 72319
[READ], 95thPercentileLatency(us), 486
[READ], 99thPercentileLatency(us), 805
[READ], Return=OK, 60004
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1898.0
[CLEANUP], MinLatency(us), 1898
[CLEANUP], MaxLatency(us), 1898
[CLEANUP], 95thPercentileLatency(us), 1898
[CLEANUP], 99thPercentileLatency(us), 1898
[UPDATE], Operations, 39996
[UPDATE], AverageLatency(us), 329.9016401640164
[UPDATE], MinLatency(us), 142
[UPDATE], MaxLatency(us), 9679
[UPDATE], 95thPercentileLatency(us), 545
[UPDATE], 99thPercentileLatency(us), 875
[UPDATE], Return=OK, 39996

-------------------------------------------------------------------